Revit 2026 API

# LoadCaseCreate(Document, String, ElementId, ElementId) Method

---

Creates a new LoadCase.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static LoadCase Create(
	Document document,
	string name,
	ElementId natureId,
	ElementId subcategoryId
)
```
```vb
Public Shared Function Create (
	document As Document,
	name As String,
	natureId As ElementId,
	subcategoryId As ElementId
) As LoadCase
```
```cpp
public:
static LoadCase^ Create(
	Document^ document,
	String^ name,
	ElementId^ natureId,
	ElementId^ subcategoryId
)
```
```fsharp
static member Create :
        document : Document *
        name : string *
        natureId : ElementId *
        subcategoryId : ElementId -> LoadCase
```

#### Parameters

document Document
     The Document to which new load case element will be added.
name String
     The name of the load case.
natureId ElementId
     The load nature ID.
subcategoryId ElementId
     The load case subcategory ID. Could be one of predefined or user defined load case category. Built-in structural Load Cases (OST_LoadCases) subcategories are: OST_LoadCasesDeadOST_LoadCasesLiveOST_LoadCasesWindOST_LoadCasesSnowOST_LoadCasesRoofLiveOST_LoadCasesAccidentalOST_LoadCasesTemperatureOST_LoadCasesSeismic

#### Return Value

LoadCase The newly created load case element if successful,  otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | The given name is not unique. |
| ArgumentNullException | A non-optional argument was null |

This method is designed to create LoadCase that is associated with user defined category.

#### Reference

LoadCase Class

Create Overload

Autodesk.Revit.DB.Structure Namespace